{
  "name": "cae91a45-1c30-4ae1-81f2-09b00b217f26",
  "displayName": "Pigeon Fact Redirect",
  "form": {
  
  },
  "entryFulfillment": {
    "messages": [ {
      "text": {
        "text": [ "Oooh, ooh, ooh! Here's a good one.", "Okay, this one's interesting." ]
      },
      "languageCode": "en"
    }, {
      "text": {
        "text": [ "Did you know that pigeons were \"probably one of the first animals to be domesticated by humans?\" According to Atlas Obscura, images and carvings of the pigeons first appear in the Middle East and North Africa around 3,000 years ago (https://www.atlasobscura.com/articles/ancient-egypt-pigeon-problem).", "According to Atlas Obscura, Ancient Egyptians kept vast quantities of pigeons, and would sacrifice tens of thousands at a time for ritual purposes! Yikes, wouldn't have wanted to ruffle *their* feathers. (https://www.atlasobscura.com/articles/ancient-egypt-pigeon-problem).", "Did you know pigeon racing is a sport? A flock of specially trained homing pigeons are released and then return to their homes at a carefully measured distance. The Wikipedia page is fascinating to learn more: https://en.wikipedia.org/wiki/Pigeon_racing", "I'm feeling dizzy. Is there a magnet attached to my back? One little known fact is that magnets interferes with pigeon homing. Researchers strapped magnets to the back of pigeons under total overcast and the pigeons with magnets were thrown off! https://pmc.ncbi.nlm.nih.gov/articles/PMC391171/", "Did you know that there is a Japanese visual novel called Hatoful Boyfriend where all the characters other than the protagonist are sentient birds? I haven't played it, but it sounds right up my alley! Maybe you might like it: https://store.steampowered.com/app/310080/Hatoful_Boyfriend/", "Have you seen the website for the National Pigeon Association? It's just amazing. \"The Backyard Hobby of Yesterday and Today!\" Get on it, seriously. Go see those amazing pigeons. https://www.npausa.com/", "The absolute best way to learn about genetics is the University of Utah game Pigeoneics, available at https://learn.genetics.utah.edu/content/pigeons/pigeonetics/. The soundtrack is also such a treat, and it is listed for free! There's also sheet music, if you are into that. https://learn.genetics.utah.edu/content/pigeons/music/" ]
      },
      "languageCode": "en"
    }, {
      "text": {
        "text": [ "Interested in hearing another?", "Want to hear another?", "How about another?" ]
      },
      "languageCode": "en"
    } ],
    "advancedSettings": {
      "playbackInterruptionSettings": {
      
      },
      "dtmfSettings": {
        "useSystemEntityRule": false
      }
    }
  },
  "transitionRoutes": [ {
    "intent": "Confirm",
    "triggerFulfillment": {
    
    },
    "targetPage": "Pigeon Fact Redirect",
    "name": "6b321e33-c541-4d51-ad57-648dccc38a39"
  }, {
    "intent": "Deny",
    "triggerFulfillment": {
      "messages": [ {
        "text": {
          "text": [ "Enough facts for one day, I get it. Let's fly back to the coop! What to dive into next, Composite, Observer, or Strategy?" ]
        },
        "languageCode": "en"
      } ],
      "advancedSettings": {
        "playbackInterruptionSettings": {
        
        },
        "dtmfSettings": {
          "useSystemEntityRule": false
        }
      }
    },
    "targetFlow": "Default Start Flow",
    "name": "81da33e4-a90c-4736-b9c4-9c56ae5ea115"
  } ],
  "transitionRouteGroups": [ "Home routes" ]
}
